SacredDarkKing/STM32_Bare-Metal_Development_Tutorial/2.7-PWMI模式测量频率和占空比/Hardware/IC.c
#include "stm32f10x.h"
#include "PWM.h"

void IC_Init(void)
{

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    TIM_InternalClockConfig(TIM3);

    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
    TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStruct.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStruct.TIM_Period = 65536 - 1;
    TIM_TimeBaseInitStruct.TIM_Prescaler = 72;
    TIM_TimeBaseInitStruct.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStruct);

    // 两个通道同时捕获一个输入引脚
    TIM_ICInitTypeDef TIM_ICInitStruct;
    TIM_ICInitStruct.TIM_Channel = TIM_Channel_1;
    TIM_ICInitStruct.TIM_ICFilter = 0xF;
    TIM_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_Rising;
    TIM_ICInitStruct.TIM_ICPrescaler = TIM_ICPSC_DIV1;
    TIM_ICInitStruct.TIM_ICSelection = TIM_ICSelection_DirectTI;
    // TIM_ICInit(TIM3, &TIM_ICInitStruct);

    // TIM_ICInitTypeDef TIM_ICInitStruct;
    // TIM_ICInitStruct.TIM_Channel = TIM_Channel_2;
    // TIM_ICInitStruct.TIM_ICFilter = 0xF;
    // TIM_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_Falling;
    // TIM_ICInitStruct.TIM_ICPrescaler = TIM_ICPSC_DIV1;
    // TIM_ICInitStruct.TIM_ICSelection = TIM_ICSelection_IndirectTI;
    // TIM_ICInit(TIM3, &TIM_ICInitStruct);

    // 上卖弄这段注释的代码等同于下面这一行的代码
    TIM_PWMIConfig(TIM3, &TIM_ICInitStruct); // 缺点：只支持通道1和2，不支持3和4

    // 设置从模式自动重置cnt
    TIM_SelectInputTrigger(TIM3, TIM_TS_TI1FP1); // 选择从模式的触发源

    TIM_SelectSlaveMode(TIM3, TIM_SlaveMode_Reset); // 选择从模式

    TIM_Cmd(TIM3, ENABLE);
}

uint32_t IC_GetFreqence(void)
{
    return 1000000 / (TIM_GetCapture1(TIM3) + 1);
}

uint32_t IC_GetDuty(void)
{
    return 100 * (TIM_GetCapture2(TIM3) + 1) / (TIM_GetCapture1(TIM3) + 1);
}
